<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4b10c4665964f839671d5f2e1a7d68de372b45aa0c652a670ac1e70a31b3124f","plan_job_ref":"Job Terraform Plan #115 at https://github.com/cal-itp/data-infra/actions/runs/14499686151","plan_out_hash":"e5195c5da565147107a8900836a6c9824bd3e848ef8ed4c875a91958733b116a","plan_hash":"7c7cdc2f0b283e8497721a70406d2f37dd4b0a1650fa56c885c2c045c2623d50","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.calitp-dds-analyst will be created
+   resource "google_project_iam_custom_role" "calitp-dds-analyst" {
+       deleted     = (known after apply)
+       description = "Custom role for DDS Analysts"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "viewer",
        ]
+       project     = "cal-itp-data-infra-staging"
+       role_id     = "***********"
+       stage       = "GA"
+       title       = "DDS Analyst"
    }

  # google_project_iam_member.DOT_DDS_Data_Pipeline_and_Warehouse_Users will be created
+   resource "google_project_iam_member" "DOT_DDS_Data_Pipeline_and_Warehouse_Users" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "principalSet://iam.googleapis.com/locations/global/workforcePools/dot-ca-gov/group/DOT_DDS_Data_Pipeline_and_Warehouse_Users"
+       project = "cal-itp-data-infra-staging"
+       role    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #115](https://github.com/cal-itp/data-infra/actions/runs/14499686151)